FVM/Non-Newtonian/2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//transportModel  CrossPowerLaw;
transportModel BirdCarreau;

nu          nu [ 0 2 -1 0 0 0 0 ] 3e-06;

BirdCarreauCoeffs
{
    a=0.64;
    nu0         [0 2 -1 0 0 0 0]  1.56e-5;
    nuInf       [0 2 -1 0 0 0 0]  1.56e-6;
    k           [0 0 1 0 0 0 0]   0.11;
    n           [0 0 0 0 0 0 0]   0.392;
}

// ************************************************************************* //
